src/Reports/ОтчетПоВыпущеннымПолуфабрикатам/ОтчетПоВыпущеннымПолуфабрикатам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоВыпущеннымПолуфабрикатам</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ГруппаСпецификаций</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПФ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Report>

src/AccumulationRegisters/ПередачиВПроизводство/ПередачиВПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПередачиВПроизводство</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.МаршрутнаяКарта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМПЗ</name>
    <type>
      <types>EnumRef.ВидыМПЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ВыпускПродукцииКанбан/ВыпускПродукцииКанбан.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыпускПродукцииКанбан</name>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ПланыВыпуска</registerRecords>
  <registerRecords>AccumulationRegister.БракПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.ПередачиВПроизводство</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБрака</name>
    <type>
      <types>CatalogRef.КомментарииНеисправностей</types>
      <types>CatalogRef.ВидыБрака</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЖизненногоЦикла</name>
    <type>
      <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Списание</name>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Reports/ОтчетПоВыпущеннымПолуфабрикатам/Forms/ФормаОтчета/Module.bsl
&НаСервере
Функция СформироватьНаСервере() 
Отчет.ТабличнаяЧасть.Очистить();
ТабДок.Очистить();

Макет = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблГруппа = Макет.ПолучитьОбласть("Группа");
ОблПФ = Макет.ПолучитьОбласть("ПФ");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.ДатаНач = Формат(Отчет.Период.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ДатаКон = Формат(Отчет.Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.Линейки = СписокЛинеек;
ТабДок.Вывести(ОблШапка);
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПередачиВПроизводствоОбороты.МПЗ КАК МПЗ,
	|	ПередачиВПроизводствоОбороты.КоличествоПриход КАК КоличествоПриход
	|ИЗ
	|	РегистрНакопления.ПередачиВПроизводство.Обороты(&ДатаНач, &ДатаКон, Регистратор, Документ.Линейка В ИЕРАРХИИ (&СписокЛинеек)) КАК ПередачиВПроизводствоОбороты
	|ГДЕ
	|	ПередачиВПроизводствоОбороты.ВидМПЗ = &ВидМПЗ
	|	И ПередачиВПроизводствоОбороты.МПЗ.Канбан = &Канбан";
	Если ОтборПо = 1 Тогда
	Запрос.Текст = Запрос.Текст + " И ПередачиВПроизводствоОбороты.Регистратор.ДокументОснование.ДокументОснование.Ремонт = ЛОЖЬ";
	Иначе
	Запрос.Текст = Запрос.Текст + " И ПередачиВПроизводствоОбороты.Регистратор.ДокументОснование.ДокументОснование.Ремонт = ИСТИНА";
	КонецЕсли; 
Запрос.Текст = Запрос.Текст + " ИТОГИ СУММА(КоличествоПриход)
								|ПО МПЗ";	  	
Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Отчет.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон",КонецДня(Отчет.Период.ДатаОкончания));
Запрос.УстановитьПараметр("СписокЛинеек",СписокЛинеек);
Запрос.УстановитьПараметр("ВидМПЗ",Перечисления.ВидыМПЗ.Полуфабрикаты);
Запрос.УстановитьПараметр("Канбан",Справочники.ВидыКанбанов.ПустаяСсылка());
Результат = Запрос.Выполнить();
Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
	ТЧ = Отчет.ТабличнаяЧасть.Добавить();
	ТЧ.ГруппаСпецификаций = ПолучитьГруппуЭтапаПроизводства(Выборка.МПЗ.Родитель);
	ТЧ.ПФ = Выборка.МПЗ;
	ТЧ.Количество = Выборка.КоличествоПриход;
	КонецЦикла;	

Запрос.Текст = 
	"ВЫБРАТЬ
	|	МестаХраненияОбороты.МПЗ,
	|	МестаХраненияОбороты.КоличествоПриход
	|ИЗ
	|	РегистрНакопления.МестаХранения.Обороты(&ДатаНач, &ДатаКон, Регистратор, ) КАК МестаХраненияОбороты
	|ГДЕ
	|	МестаХраненияОбороты.Регистратор.ДокументОснование.Линейка В ИЕРАРХИИ(&СписокЛинеек)
	|	И МестаХраненияОбороты.ВидМПЗ = &ВидМПЗ
	|	И (ТИПЗНАЧЕНИЯ(МестаХраненияОбороты.Регистратор.Ссылка) = ТИП(Документ.ВыпускПродукции)
	|		ИЛИ ТИПЗНАЧЕНИЯ(МестаХраненияОбороты.Регистратор.Ссылка) = ТИП(Документ.ВыпускПродукцииКанбан))";
	Если ОтборПо = 1 Тогда
	Запрос.Текст = Запрос.Текст + " И МестаХраненияОбороты.Регистратор.ДокументОснование.ДокументОснование.Ремонт = ЛОЖЬ";
	Иначе
	Запрос.Текст = Запрос.Текст + " И МестаХраненияОбороты.Регистратор.ДокументОснование.ДокументОснование.Ремонт = ИСТИНА";
	КонецЕсли; 
Запрос.Текст = Запрос.Текст + " ИТОГИ СУММА(КоличествоПриход)
								|ПО МПЗ";	  	
Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Отчет.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон",КонецДня(Отчет.Период.ДатаОкончания));
Запрос.УстановитьПараметр("СписокЛинеек",СписокЛинеек);
Запрос.УстановитьПараметр("ВидМПЗ",Перечисления.ВидыМПЗ.Полуфабрикаты);
Результат = Запрос.Выполнить();
Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
	ТЧ = Отчет.ТабличнаяЧасть.Добавить();
	ТЧ.ГруппаСпецификаций = ПолучитьГруппуЭтапаПроизводства(Выборка.МПЗ.Родитель);
	ТЧ.ПФ = Выборка.МПЗ;
	ТЧ.Количество = Выборка.КоличествоПриход;
	КонецЦикла;	
Отчет.ТабличнаяЧасть.Сортировать("ГруппаСпецификаций,ПФ");
ТекГруппа = Справочники.Номенклатура.ПустаяСсылка();
	Для каждого ТЧ Из Отчет.ТабличнаяЧасть Цикл
		Если ТекГруппа <> ТЧ.ГруппаСпецификаций Тогда
		ОблГруппа.Параметры.ГруппаСпецификаций = ТЧ.ГруппаСпецификаций;
		ТабДок.Вывести(ОблГруппа);
		ТекГруппа = ТЧ.ГруппаСпецификаций;
		КонецЕсли; 
	ОблПФ.Параметры.ПФ = ТЧ.ПФ;
	ОблПФ.Параметры.Наименование = СокрЛП(ТЧ.ПФ.Наименование);
	ОблПФ.Параметры.Количество = ТЧ.Количество;
	ТабДок.Вывести(ОблПФ);
	КонецЦикла; 
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 3;
КонецФункции

&НаКлиенте
Процедура Сформировать(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	Состояние("Обработка...",,"Формирование отчёта...");	
	СформироватьНаСервере();		
	КонецЕсли;  
КонецПроцедуры
